project/app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."id" DESC
---
  def index
    product = Product.all.order(id: :desc)

INSERT INTO "products" ("name", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "wqer"], ["price", 134], ["amount", 22], ["created_at", "2020-12-11 03:34:41.973562"], ["updated_at", "2020-12-11 03:34:41.973562"]]
---
  def create
    product = Product.create!(product_params)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "price" = ?, "amount" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "qwer"], ["price", 234], ["amount", 111], ["updated_at", "2020-12-11 17:28:48.039217"], ["id", 2]]
---
  def edit
    @product ||= Product.find("22")
    @product.update(name: params[:name], price: params[:price], amount: params[:amount])

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 17]]
---
  def destroy
    product&.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def product
    @product ||= Product.find(params[:id])