auth_api_for_project/app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(username: session_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "qaz"], ["LIMIT", 1]]